{"events":[{"title":"Marketing Design","time":"2-19-2021 6:00 PM","type":"Workshop","description":"This week we'll be talking about the kinds of questions designers in the marketing space have to consider in their designs. We'll be covering things like landing page conversion practices, what A/B testing is, and the role marketing designers in the companies they work for.","location":"Online","links":[{"label":"Zoom Link","link":"https://uci.zoom.us/j/5080955339"}]},{"title":"Differences Between In-House & Agency Product Design","time":"2-12-2021 6:00 PM","type":"Industry Speakers","description":"Join our two live industry guest speakers talk about the differences between in-house product design and agency product design. \"Hi I’m Vinson Gotingco, an experience designer with 4 years of experience in the industry. I started off at UCI as a computer science major (when IC21 was the intro course. I’m that old.) , but coding wasn’t really for me. I was more interested in the work I was doing as a graphic designer at the bookstore. I eventually switched into informatics and the rest is history\". \"Hi I’m Nathaniel Valerio, a Product Designer currently at Mixpanel. I previously worked as a designer on Firebase as well as many other different industries. I am a self taught designer, who like Vinson, at UCI, saw coding was not my cup of tea and thus took up Informatics. I was inspired to enter the creative world from my time as a dancer.\"","location":"Online","links":[{"label":"Zoom Link","link":"https://uci.zoom.us/j/5080955339"}]},{"title":"We’re Not Really Strangers Virtual Card Game Social","time":"2-11-2021 7:30 PM","type":"Social Event","description":"We're playing the 'We’re Not Really Strangers' card game virtually! Card dealers will read off one question at a time, and we will go around the virtual room and one person answers one question (You can opt for a different one if you feel uncomfortable sharing). A fun game that is meant to deepen existing relationships and create new ones!","location":"Online","links":[{"label":"Zoom Link","link":"https://uci.zoom.us/j/5080955339"}]},{"title":"Manifest x Design Pitch and Collaboration","time":"1-29-2021 6:00 PM","type":"Networking Event","description":"Let’s make some new connections! Design at UCI will be collaborating with the awesome individuals from Manifest. Bringing together student start-ups, this will be a great opportunity for you to grow your portfolio as these companies will be looking for UX designers to join their new exciting projects!","location":"Online","links":[{"label":"Zoom Link","link":"https://uci.zoom.us/j/5080955339"},{"label":"Slides","link":"https://google.com"}]}]}